[
  {
    "id": "ASC 101",
    "deptCode": "ASC",
    "deptName": null,
    "number": "101",
    "code": "ASC 101",
    "title": "Practicing Engaging Presentations",
    "description": "An introduction to the basics of public speaking, including how to engage audiences with relevant and engaging resources. Each week, students prepare and give presentations on various topics, and develop skills including using appropriate body language, effectively utilizing audio and visual aids, finding a personal presentation style, and handling the unexpected. Presentation formats addressed include introductory, instructional, and informational. Students receive feedback from instructors and peers, and are expected to build upon this feedback each week.",
    "credits": 0,
    "active": true,
    "rawPrerequisites": null,
    "prerequisites": null,
    "corequisites": null,
    "advisorNotes": null,
    "url": "https://catalog.stonybrook.edu/preview_course_nopop.php?catoid=8&coid=8806"
  },
  {
    "id": "ACC 210",
    "deptCode": "ACC",
    "deptName": null,
    "number": "210",
    "code": "ACC 210",
    "title": "Financial Accounting",
    "description": "This course presents an introduction to fundamental financial accounting principles, concentrating on identifying, recording, and communicating the economic events of a business organization. Topics include the accounting cycle, the preparation and presentation of the income statement, retained earnings statement and balance sheet, and an in-depth exploration of the measure and presentation of assets and liabilities.",
    "credits": 3,
    "active": true,
    "rawPrerequisites": "Business Major or ACC Minor or MTD or ECO or ISE Major or FIN Minor",
    "prerequisites": {
      "kind": "TRUE"
    },
    "corequisites": null,
    "advisorNotes": null,
    "url": "https://catalog.stonybrook.edu/preview_course_nopop.php?catoid=8&coid=8447"
  },
  {
    "id": "ACC 214",
    "deptCode": "ACC",
    "deptName": null,
    "number": "214",
    "code": "ACC 214",
    "title": "Managerial Cost Analysis and Applications",
    "description": "A study of cost concepts, and theories as it relates to cost accumulation systems for product, process and activity based costing, as well as the implementation and evaluation of an accounting system as a source of information for decision making, planning, control, and evaluation of the organization by management. Includes cost-volume-profit analysis, overhead rates, budgeting and variance analysis, statement of cash flows and financial statement ratio analysis.",
    "credits": 3,
    "active": true,
    "rawPrerequisites": "BUS major or ACC minor or FIN minor or ISE major",
    "prerequisites": {
      "kind": "TRUE"
    },
    "corequisites": null,
    "advisorNotes": null,
    "url": "https://catalog.stonybrook.edu/preview_course_nopop.php?catoid=8&coid=8448"
  },
  {
    "id": "ACC 301",
    "deptCode": "ACC",
    "deptName": null,
    "number": "301",
    "code": "ACC 301",
    "title": "Governmental & Not-for-Profit Accounting and Reporting",
    "description": "This course is designed to introduce the student to the accounting and financial reporting practices of governmental and not-for-profit entities. The course will explore standards issued by the Financial Accounting Standards Board (FASB) and the Governmental Accounting Standards Board (GASB). Students will also familiarize themselves with the various funds and groups of accounts applicable to governmental entities, as well as financial reporting for nonprofit organizations, including colleges, universities and hospitals.",
    "credits": 3,
    "active": true,
    "rawPrerequisites": "ACC 210 ​",
    "prerequisites": {
      "kind": "COURSE",
      "courseId": "ACC 210"
    },
    "corequisites": null,
    "advisorNotes": null,
    "url": "https://catalog.stonybrook.edu/preview_course_nopop.php?catoid=8&coid=22748"
  },
  {
    "id": "ACC 310",
    "deptCode": "ACC",
    "deptName": null,
    "number": "310",
    "code": "ACC 310",
    "title": "Intermediate Accounting I",
    "description": "This course expands upon the basic financial accounting framework and explores the theoretical and analytical applications of Generally Accepted Accounting Principles (GAAP) in a business environment. The student will gain an understanding of financial reporting criteria and the reliance placed upon financial information by external users. Topics include the measurement and reporting of cash, receivables, inventories, and operational assets, revenue recognition and the preparation of financial statements.",
    "credits": 3,
    "active": true,
    "rawPrerequisites": "BUS major or ACC minor and ACC 210",
    "prerequisites": {
      "kind": "COURSE",
      "courseId": "ACC 210"
    },
    "corequisites": null,
    "advisorNotes": null,
    "url": "https://catalog.stonybrook.edu/preview_course_nopop.php?catoid=8&coid=8449"
  },
  {
    "id": "ACC 311",
    "deptCode": "ACC",
    "deptName": null,
    "number": "311",
    "code": "ACC 311",
    "title": "Federal Income Taxation I",
    "description": "Introduces and explores fundamental income taxation concepts for individuals. Topics include gross income, exclusions, adjusted gross income, deductions, exemptions, tax computations, and credits. Introductory tax concepts, including cash and accrual methods, property acquisitions and dispositions, like-kind exchanges, and passive loss rules are also reviewed. Additionally, students will familiarize themselves with tax planning concepts, the legislative process, and professional responsibilities in tax practice.",
    "credits": 3,
    "active": true,
    "rawPrerequisites": "BUS major or ACC minor",
    "prerequisites": {
      "kind": "TRUE"
    },
    "corequisites": null,
    "advisorNotes": null,
    "url": "https://catalog.stonybrook.edu/preview_course_nopop.php?catoid=8&coid=8450"
  },
  {
    "id": "ACC 313",
    "deptCode": "ACC",
    "deptName": null,
    "number": "313",
    "code": "ACC 313",
    "title": "Intermediate Accounting II",
    "description": "This course is the second in the intermediate accounting sequence ( ACC 310 ). This course continues in the exploration of the financial accounting framework and the theoretical and analytical applications of Generally Accepted Accounting Principles (GAAP). Topics the study of advanced topics including accounting for investments, stockholders equity, pensions, leases, income taxes, bonds, and other contemporary financial accounting issues.",
    "credits": 3,
    "active": true,
    "rawPrerequisites": "BUS major or ACC Minor and ACC 310",
    "prerequisites": {
      "kind": "COURSE",
      "courseId": "ACC 310"
    },
    "corequisites": null,
    "advisorNotes": null,
    "url": "https://catalog.stonybrook.edu/preview_course_nopop.php?catoid=8&coid=8451"
  },
  {
    "id": "ACC 314",
    "deptCode": "ACC",
    "deptName": null,
    "number": "314",
    "code": "ACC 314",
    "title": "Federal Income Taxation II",
    "description": "Introduces and explores fundamental income taxation concepts for business entities, with a focus on C corporations, S corporations, and partnerships. Topics include the formation, operation, reorganization and liquidation of C corporations, as well as the formation, operation and liquidation of flow-through entities. Students will also familiarize themselves with specialty topics concerning estates and trusts, transfer taxes and jurisdictional taxation.",
    "credits": 3,
    "active": true,
    "rawPrerequisites": "BUS Major or ACC Minor and ACC 311",
    "prerequisites": {
      "kind": "COURSE",
      "courseId": "ACC 311"
    },
    "corequisites": null,
    "advisorNotes": null,
    "url": "https://catalog.stonybrook.edu/preview_course_nopop.php?catoid=8&coid=8452"
  },
  {
    "id": "ACC 320",
    "deptCode": "ACC",
    "deptName": null,
    "number": "320",
    "code": "ACC 320",
    "title": "Artificial Intelligence in Accounting and Assurance",
    "description": "This course introduces the concepts and applications of AI in modern organizations from the perspective of accounting and auditing. In this context, AI broadly refers to the technologies employed in enterprise accounting, including Machine Learning (ML), Natural Language Processing (NLP), and Robotic Process Automation (RPA). To illustrate the underlying principles and implementations of AI in accounting and auditing, this course also introduces AI tools and demonstrates its applications to analyzing real-world data. Students gain hands-on experience with AI software for accounting and auditing.",
    "credits": 3,
    "active": true,
    "rawPrerequisites": "BUS major or ACC minor and ACC 210",
    "prerequisites": {
      "kind": "COURSE",
      "courseId": "ACC 210"
    },
    "corequisites": null,
    "advisorNotes": null,
    "url": "https://catalog.stonybrook.edu/preview_course_nopop.php?catoid=8&coid=22747"
  },
  {
    "id": "ACC 400",
    "deptCode": "ACC",
    "deptName": null,
    "number": "400",
    "code": "ACC 400",
    "title": "External Auditing",
    "description": "The course is designed to introduce and explore basic auditing principles, concepts and applications within the context of the audit of an annual financial statement. This course will review the audit process and cover the following: planning (identification of the risks of material misstatement); application of procedures (reducing audit risk below an acceptable level); assessment (based upon documented audit evidence); and, reporting (in accordance with generally accepted auditing standards) This course will also examine professional ethical standards and their relevance to the audit process. Other topics will include analysis and testing of internal control, substantive testing, and accounting research.",
    "credits": 3,
    "active": true,
    "rawPrerequisites": "BUS Major or ACC minor and ACC 210",
    "prerequisites": {
      "kind": "COURSE",
      "courseId": "ACC 210"
    },
    "corequisites": null,
    "advisorNotes": null,
    "url": "https://catalog.stonybrook.edu/preview_course_nopop.php?catoid=8&coid=8453"
  },
  {
    "id": "ACC 401",
    "deptCode": "ACC",
    "deptName": null,
    "number": "401",
    "code": "ACC 401",
    "title": "Intermediate Managerial Accounting & Data Analytics",
    "description": "The course is designed to build upon the principles and concepts in an introductory managerial accounting course with a focus on applied skills. This course will review business planning, performance evaluation, cost flows, setting and achieving targets in a customer domain, and strategic cost management. This course will also examine the ethics associated with managing a large and complex organization. Lastly, this course will provide an overview of data analytics as it pertains to managerial accounting, auditing, and taxation.",
    "credits": 3,
    "active": true,
    "rawPrerequisites": "Business major; BUS 215 ; ACC 214 ; and ACC 313",
    "prerequisites": {
      "kind": "AND",
      "nodes": [
        {
          "kind": "COURSE",
          "courseId": "ACC 214"
        },
        {
          "kind": "COURSE",
          "courseId": "ACC 313"
        }
      ]
    },
    "corequisites": null,
    "advisorNotes": null,
    "url": "https://catalog.stonybrook.edu/preview_course_nopop.php?catoid=8&coid=22749"
  },
  {
    "id": "ACC 402",
    "deptCode": "ACC",
    "deptName": null,
    "number": "402",
    "code": "ACC 402",
    "title": "Advanced Accounting",
    "description": "This course provides students with in-depth and up-to-date coverage of accounting for investments, business combinations, consolidated financial statements, segment and interim reporting, foreign currency transactions, and partnerships. The course links theory and practice with consistent emphasis on the logic of procedures.",
    "credits": 3,
    "active": true,
    "rawPrerequisites": "ACC 313",
    "prerequisites": {
      "kind": "COURSE",
      "courseId": "ACC 313"
    },
    "corequisites": null,
    "advisorNotes": null,
    "url": "https://catalog.stonybrook.edu/preview_course_nopop.php?catoid=8&coid=11666"
  },
  {
    "id": "AIM 100",
    "deptCode": "AIM",
    "deptName": null,
    "number": "100",
    "code": "AIM 100",
    "title": "EOP Pre-Freshman Summer Academic Bridge",
    "description": "The purpose of the EOP Summer Academic Bridge course is to give students a foundation in math, writing, and a science related to their undergraduate goals. The course will build on their current skills with the goal of increasing the likelihood of their academic success in these areas during their first full semester at Stony Brook University. Students will be placed in the appropriate section based on the university placement recommendations in math and writing. The EOP Summer Academic Bridge will be supported through the EOP Transitional Support Bridge course.",
    "credits": 3,
    "active": true,
    "rawPrerequisites": null,
    "prerequisites": null,
    "corequisites": null,
    "advisorNotes": null,
    "url": "https://catalog.stonybrook.edu/preview_course_nopop.php?catoid=8&coid=8534"
  },
  {
    "id": "AIM 101",
    "deptCode": "AIM",
    "deptName": null,
    "number": "101",
    "code": "AIM 101",
    "title": "EOP Pre-Freshman Summer Support Bridge",
    "description": "The purpose of the EOP Summer Bridge course is to build a strong, supportive foundation by introducing the necessary support and resources needed to be successful at Stony Brook University. The course will build on their current skills with the goal of increasing the likelihood of the student’s success in acclimating to college and Stony Brook University culture and lifestyle. Additionally, the course goal is to help students navigate the challenges that stem from socioeconomic disadvantage. In addition, this course will support the EOP Academic Bridge course.",
    "credits": 3,
    "active": true,
    "rawPrerequisites": null,
    "prerequisites": null,
    "corequisites": null,
    "advisorNotes": null,
    "url": "https://catalog.stonybrook.edu/preview_course_nopop.php?catoid=8&coid=8535"
  },
  {
    "id": "AIM 102",
    "deptCode": "AIM",
    "deptName": null,
    "number": "102",
    "code": "AIM 102",
    "title": "Expository Writing",
    "description": "The fundamentals of grammar through investigating methods of interpreting various forms of literature with emphasis on the process of writing and re-writing. Does not count toward graduation. A through C/Unsatisfactory grading only. The Pass/No credit option may not be used. Open to EOP/AIM students only.",
    "credits": 3,
    "active": true,
    "rawPrerequisites": "Placement by writing placement examination",
    "prerequisites": {
      "kind": "TRUE"
    },
    "corequisites": null,
    "advisorNotes": null,
    "url": "https://catalog.stonybrook.edu/preview_course_nopop.php?catoid=8&coid=8536"
  },
  {
    "id": "AIM 104",
    "deptCode": "AIM",
    "deptName": null,
    "number": "104",
    "code": "AIM 104",
    "title": "Literary Analysis and Critical Reasoning",
    "description": "Introduction to literary analysis and critical reasoning through close examination of selected works. Open to EOP/AIM students only. A through C/Unsatisfactory grading only. The Pass/No credit option may not be used.",
    "credits": 3,
    "active": true,
    "rawPrerequisites": "Placement by writing placement examination",
    "prerequisites": {
      "kind": "TRUE"
    },
    "corequisites": null,
    "advisorNotes": null,
    "url": "https://catalog.stonybrook.edu/preview_course_nopop.php?catoid=8&coid=8537"
  },
  {
    "id": "ADV 101",
    "deptCode": "ADV",
    "deptName": null,
    "number": "101",
    "code": "ADV 101",
    "title": "Advising 101 Transfer Seminar",
    "description": "A seminar intended to integrate transfer students into the University community by sharing information about Stony Brook and creating a forum to develop intellectual, social, writing, and communication skills. The course emphasizes institutional expectations to promote student success. Recommended for first semester transfer students entering with less than 57 earned credits. Required for all first semester international transfer students. Not for credit in addition to ACH 101, GLS 101, HDV 101, ITS 101, LDS 101, LSE 101, SBU 101 , SCH 101 , or SSO 101.",
    "credits": 1,
    "active": true,
    "rawPrerequisites": "New transfer student",
    "prerequisites": {
      "kind": "TRUE"
    },
    "corequisites": null,
    "advisorNotes": null,
    "url": "https://catalog.stonybrook.edu/preview_course_nopop.php?catoid=8&coid=8454"
  },
  {
    "id": "ADV 201",
    "deptCode": "ADV",
    "deptName": null,
    "number": "201",
    "code": "ADV 201",
    "title": "Preparing for Medical School",
    "description": "This course provides a broad survey of pre-medical studies, preparation for medical school admission, and the medical profession. The course will review medical school admission requirements and procedures, the academic coursework at both the undergraduate and professional school levels, the residency training of the physician, the typical routines of a medical practice, and other issues affecting the training of a medical doctor in the United States. In addition, the class will provide students opportunities for continual self-evaluation of personal motivations to enter the health profession. The course follows the chronological sequence taken by the traditional student to become a licensed medical doctor, and examines how this sequence of events plays an integral role in the development of a capable physician.",
    "credits": 1,
    "active": true,
    "rawPrerequisites": "U2 or higher standing. Completion of at least one pre-medical science sequence and permission of the instructor.",
    "prerequisites": {
      "kind": "TRUE"
    },
    "corequisites": null,
    "advisorNotes": null,
    "url": "https://catalog.stonybrook.edu/preview_course_nopop.php?catoid=8&coid=8455"
  },
  {
    "id": "ADV 202",
    "deptCode": "ADV",
    "deptName": null,
    "number": "202",
    "code": "ADV 202",
    "title": "Academic Success Seminar",
    "description": "Designed to help students develop essential skills needed to become lifelong, self-regulated and self-motivated learners. Through guided journals and assignments, students will use self-reflection to identify possible self sabotaging thoughts and behaviors and discover what may be getting in the way of their academic and personal success. Students will discover how they learn and develop and strengthen their study skills. Topics to be covered include motivation, how memory works, metacognition, critical thinking, decision making, attention and concentration, goal setting, time management and other study skills strategies.",
    "credits": 2,
    "active": true,
    "rawPrerequisites": "Permission of instructor",
    "prerequisites": {
      "kind": "TRUE"
    },
    "corequisites": null,
    "advisorNotes": null,
    "url": "https://catalog.stonybrook.edu/preview_course_nopop.php?catoid=8&coid=8456"
  },
  {
    "id": "ADV 475",
    "deptCode": "ADV",
    "deptName": null,
    "number": "475",
    "code": "ADV 475",
    "title": "Undergraduate Teaching Practicum I",
    "description": "Work as an assistant with an instructor of an ADV 101 regularly scheduled class or with the coordinator/instructor of ADV 488 . The student is required to attend all classes, keep current with the regularly assigned work, and meet with the instructor at regularly scheduled times to discuss the intellectual and pedagogical matters relating to the course.",
    "credits": 0,
    "active": true,
    "rawPrerequisites": "U3 or U4 standing; permission of ADV 101 or ADV 488 coordinator and director of the Academic & Transfer Advising Services Center; completion of ADV 101 or ADV 488 or equivalent experience",
    "prerequisites": {
      "kind": "AND",
      "nodes": [
        {
          "kind": "COURSE",
          "courseId": "ADV 101"
        },
        {
          "kind": "COURSE",
          "courseId": "ADV 488"
        },
        {
          "kind": "COURSE",
          "courseId": "ADV 101"
        },
        {
          "kind": "COURSE",
          "courseId": "ADV 488"
        }
      ]
    },
    "corequisites": null,
    "advisorNotes": null,
    "url": "https://catalog.stonybrook.edu/preview_course_nopop.php?catoid=8&coid=8457"
  },
  {
    "id": "ADV 476",
    "deptCode": "ADV",
    "deptName": null,
    "number": "476",
    "code": "ADV 476",
    "title": "Undergraduate Teaching Practicum II",
    "description": "Work as an assistant with an instructor of an ADV 101 regularly scheduled class or with the coordinator/instructor of ADV 488 . The student is required to attend all classes, keep current with the regularly assigned work, and meet with the instructor at regularly scheduled times to discuss the intellectual and pedagogical matters relating to the course. The student assumes greater responsibility in such areas as leading discussions and researching class-appropriate topics.",
    "credits": 0,
    "active": true,
    "rawPrerequisites": "ADV 475 ; permission of ADV 101 or ADV 488 coordinator and director of the Academic & Transfer Advising Services Center",
    "prerequisites": {
      "kind": "AND",
      "nodes": [
        {
          "kind": "COURSE",
          "courseId": "ADV 475"
        },
        {
          "kind": "COURSE",
          "courseId": "ADV 101"
        },
        {
          "kind": "COURSE",
          "courseId": "ADV 488"
        }
      ]
    },
    "corequisites": null,
    "advisorNotes": null,
    "url": "https://catalog.stonybrook.edu/preview_course_nopop.php?catoid=8&coid=8458"
  },
  {
    "id": "ADV 488",
    "deptCode": "ADV",
    "deptName": null,
    "number": "488",
    "code": "ADV 488",
    "title": "Academic and Transfer Advising Services Internship",
    "description": "This two semester internship offers outstanding juniors and seniors an opportunity to gain advising experience, improve personal and professional skills, and explore career aspirations while providing assistance to others. Responsibilities include a teaching assistantship for a first semester transfer student seminar, provide support to undergraduates on making the academic and personal transition to Stony Brook, conducting oral presentations with other Academic Peer Advisors to students, and serving as a role model and mentor for other Stony Brook undergraduates. Interns are required to attend a weekly Academic Peer Advisor seminar, complete a set number of outreach hours, assist with events across campus and work in the Advising and Transfer Advising Services Center. Repeatable to a maximum of 12 credits.",
    "credits": 3,
    "active": true,
    "rawPrerequisites": "Students are selected for the course based on an application which may be obtained from the advising office. Students must have earned 45 credits and a 3.0 cumulative GPA by the application date.",
    "prerequisites": {
      "kind": "TRUE"
    },
    "corequisites": null,
    "advisorNotes": null,
    "url": "https://catalog.stonybrook.edu/preview_course_nopop.php?catoid=8&coid=8459"
  },
  {
    "id": "AFH 101",
    "deptCode": "AFH",
    "deptName": null,
    "number": "101",
    "code": "AFH 101",
    "title": "The Wonders of the Black World",
    "description": "This class is an introductory, general education, diversity class in which students are introduced to global issues that directly impact their lives. Starting with the construction of Blackness in the United States at the intersection between historical memories and American indigenous knowledge, the class analyzes what it means to be Back today: in the United States first, using the students own environment and histories, and then across the general landscape of Global Blackness. The goal is to lay the background for an appreciation of the Black world in its diverse manifestations from Africa to the Americas (Latin America, United States, Canada, the Caribbean), from Asia (India, the Middle East) to Europe (Spain, France, England, etc.).",
    "credits": 3,
    "active": true,
    "rawPrerequisites": null,
    "prerequisites": null,
    "corequisites": null,
    "advisorNotes": null,
    "url": "https://catalog.stonybrook.edu/preview_course_nopop.php?catoid=8&coid=8460"
  },
  {
    "id": "AFH 205",
    "deptCode": "AFH",
    "deptName": null,
    "number": "205",
    "code": "AFH 205",
    "title": "Contemporary African Literature",
    "description": "Contemporary African Literature is an introductory course on fictional and nonfictional works by canonized African writers from the African continent and the diaspora. Close readings of literature by authors from the 1950s to the present day, such as Chinua Achebe, Ngugi Wa Thiong’o, and Chimamanda Adichie unveil literary traditions, themes, and motifs specific to African writing. An examination of the writers’ attention to topics such as (colonialism, ethnic war, gender oppression, migration, and Afropolitanism) allows for a critical analysis of the historical, social, and political issues on the African continent. The authors’ discussions about globalization and its impact on African nations, particularly in relationship to the global marketplace, highlight the paradoxical nature of Africa’s rich natural resources (oil, diamonds and coltan) against the continent’s economic dependency on global investors. Postcolonialism, Feminism, and Psychoanalytic theory will enrich students’ interpretation and analysis of the texts.",
    "credits": 3,
    "active": true,
    "rawPrerequisites": null,
    "prerequisites": null,
    "corequisites": null,
    "advisorNotes": null,
    "url": "https://catalog.stonybrook.edu/preview_course_nopop.php?catoid=8&coid=8461"
  },
  {
    "id": "AFH 206",
    "deptCode": "AFH",
    "deptName": null,
    "number": "206",
    "code": "AFH 206",
    "title": "Great Books of the Black Experience",
    "description": "An exploration of some of the key writings from autobiographies to novels, etc., important to becoming familiar with central lines of thought and interpretation in the larger Black Experience. Focus and readings vary depending on each semester’s emphasis.",
    "credits": 3,
    "active": true,
    "rawPrerequisites": null,
    "prerequisites": null,
    "corequisites": null,
    "advisorNotes": null,
    "url": "https://catalog.stonybrook.edu/preview_course_nopop.php?catoid=8&coid=8462"
  },
  {
    "id": "AFH 215",
    "deptCode": "AFH",
    "deptName": null,
    "number": "215",
    "code": "AFH 215",
    "title": "Hip Hop and the Intellectual Tradition",
    "description": "Examines the world of hip-hop, by framing it within the fields of intellectual theory and examining the scholarly and artistic contributions of rap artists, writers, and scholars who intellectualize the global and cultural phenomenon of Hip Hop. This course will attempt to complicate the largely historical and non-theoretical treatment of hip hop in mass-mediated portrayals by engaging in a cultural studies critique of youth cultural formations and the rapid global industrialization of hip-hop. The course will also highlight how contemporary issues concerning racial and gender politics, sexual orientation, globalization, and neocolonialism are tackled by the music and culture.",
    "credits": 3,
    "active": true,
    "rawPrerequisites": null,
    "prerequisites": null,
    "corequisites": null,
    "advisorNotes": null,
    "url": "https://catalog.stonybrook.edu/preview_course_nopop.php?catoid=8&coid=8463"
  },
  {
    "id": "AFH 249",
    "deptCode": "AFH",
    "deptName": null,
    "number": "249",
    "code": "AFH 249",
    "title": "African-American Literature and Music in the 19th and 20th Centuries",
    "description": "A detailed look at African-American literature and music and their importance for American literature and music of the 19th and 20th centuries. An examination of the literature with attention to the special stylistic devices, tones of literary voice, and characterization that writers use in their efforts to match the music experience with the written word. Selections from the recordings of African-American and African-American inspired musicians – from Bessie Smith and Louis Armstrong to Jimi Henrix and the Rolling Stones.This course is offered as both AFH 249 and EGL 249 .",
    "credits": 3,
    "active": true,
    "rawPrerequisites": null,
    "prerequisites": null,
    "corequisites": null,
    "advisorNotes": null,
    "url": "https://catalog.stonybrook.edu/preview_course_nopop.php?catoid=8&coid=8464"
  },
  {
    "id": "AFH 282",
    "deptCode": "AFH",
    "deptName": null,
    "number": "282",
    "code": "AFH 282",
    "title": "Contemporary Caribbean Women’s Literature",
    "description": "Examines the political, social, and historical experiences of women from anglophone francophone, and hispanophone Caribbean nations. The readings, movies, and projects selected for the course highlight reccurent themes in Caribbean literature such as exile, migration, identity, colorism, slavery, sexual oppression, transnational motherhood, and identity politics. Feminist criticism, Postcolonialsm, and critical race theory will be applied to our reading of the texts.",
    "credits": 3,
    "active": true,
    "rawPrerequisites": null,
    "prerequisites": null,
    "corequisites": null,
    "advisorNotes": null,
    "url": "https://catalog.stonybrook.edu/preview_course_nopop.php?catoid=8&coid=8465"
  },
  {
    "id": "AFH 329",
    "deptCode": "AFH",
    "deptName": null,
    "number": "329",
    "code": "AFH 329",
    "title": "Pan-African Literature I",
    "description": "An examination of the cultural themes of Pan-Africanism and negritude, drawing on a selection of writers from the United States, Africa, and the Caribbean. The course treats the development, diffusion, and significance of these themes. It involves intensive consideration of selected literary works of African and African-American expression.",
    "credits": 3,
    "active": true,
    "rawPrerequisites": "U3 or U4 standing",
    "prerequisites": {
      "kind": "TRUE"
    },
    "corequisites": null,
    "advisorNotes": null,
    "url": "https://catalog.stonybrook.edu/preview_course_nopop.php?catoid=8&coid=8466"
  },
  {
    "id": "AFH 330",
    "deptCode": "AFH",
    "deptName": null,
    "number": "330",
    "code": "AFH 330",
    "title": "Pan-African Literature II",
    "description": "An examination of the cultural themes of Pan-Africanism and negritude, drawing on a selection of writers from the United States, Africa, and the Caribbean. The course treats the development, diffusion, and significance of these themes. It involves intensive consideration of selected literary works of African and African-American expression.",
    "credits": 3,
    "active": true,
    "rawPrerequisites": "U3 or U4 standing",
    "prerequisites": {
      "kind": "TRUE"
    },
    "corequisites": null,
    "advisorNotes": null,
    "url": "https://catalog.stonybrook.edu/preview_course_nopop.php?catoid=8&coid=8467"
  },
  {
    "id": "AFH 339",
    "deptCode": "AFH",
    "deptName": null,
    "number": "339",
    "code": "AFH 339",
    "title": "Arts of the African Diaspora",
    "description": "A study of the arts of the African Diaspora from the African continent to Brazil, Surinam, the Caribbean, and the United States. Emphasis is on the full range of art forms, including not only sculptural and performance traditions, but also textiles, basketry, and other crafts. Cultural continuities, spiritual belief, and significant changes in context, meaning, style, and technology are examined.",
    "credits": 3,
    "active": true,
    "rawPrerequisites": "U3 or U4 standing",
    "prerequisites": {
      "kind": "TRUE"
    },
    "corequisites": null,
    "advisorNotes": null,
    "url": "https://catalog.stonybrook.edu/preview_course_nopop.php?catoid=8&coid=8468"
  },
  {
    "id": "AFH 368",
    "deptCode": "AFH",
    "deptName": null,
    "number": "368",
    "code": "AFH 368",
    "title": "Caribbean and American Connections in Literature",
    "description": "An exploration of the connections between writers from the French-speaking and English-speaking Caribbean and from the African-American community, who share a similar cultural heritage, historical heritage, and historical experience, but differ in geopolitical situations. Special attention is paid to spirituality, gender, and identity motifs in the literature. Covers the Interdisciplinary topic for the English major.",
    "credits": 3,
    "active": true,
    "rawPrerequisites": "U3 or U4 standing",
    "prerequisites": {
      "kind": "TRUE"
    },
    "corequisites": null,
    "advisorNotes": null,
    "url": "https://catalog.stonybrook.edu/preview_course_nopop.php?catoid=8&coid=8469"
  },
  {
    "id": "AFH 379",
    "deptCode": "AFH",
    "deptName": null,
    "number": "379",
    "code": "AFH 379",
    "title": "Philosophy of Race (III)",
    "description": "Examination of our assumptions about race and the impact of those assumptions on issues concerning gender, class, and sexuality throughout American history. Readings include critical race theory, feminist theory, and critical legal theory. Students examine racial issues from a philosophical perspective and consider the ways in which representations of race may reinforce patterns of power and privilege.",
    "credits": 3,
    "active": true,
    "rawPrerequisites": "one PHI course",
    "prerequisites": {
      "kind": "TRUE"
    },
    "corequisites": null,
    "advisorNotes": null,
    "url": "https://catalog.stonybrook.edu/preview_course_nopop.php?catoid=8&coid=8470"
  },
  {
    "id": "AFH 380",
    "deptCode": "AFH",
    "deptName": null,
    "number": "380",
    "code": "AFH 380",
    "title": "African American and Caribbean Theatre",
    "description": "African American and Caribbean Theatre examines the connection between Black theatre and political and social movements of the 1940s to the 2000s. The course studies how playwrights use theatre to educate audiences about specific injustices of the day. An historical reading of the plays by playwrights such as Wole Soyinka, August Wilson, Lorraine Hansberry, and Susan Lori Parks introduces students to major topics for discussion in black theatre, including racial politics, socio-political disenfranchisement, the struggle to define self, and alienation from the community/society.",
    "credits": 3,
    "active": true,
    "rawPrerequisites": "U3 or U4 standing",
    "prerequisites": {
      "kind": "TRUE"
    },
    "corequisites": null,
    "advisorNotes": null,
    "url": "https://catalog.stonybrook.edu/preview_course_nopop.php?catoid=8&coid=8471"
  },
  {
    "id": "AFH 382",
    "deptCode": "AFH",
    "deptName": null,
    "number": "382",
    "code": "AFH 382",
    "title": "Black Women’s Literature of the African Diaspora",
    "description": "Black women’s literature presents students with the opportunity to examine through literature the political, social, and historical experiences of Black women from the African Diaspora. The course is structured around five major themes commonly addressed in Black women’s writing: Black female oppression, sexual politics of Black womanhood, Black female sexuality, Black male/female relationships, and Black women and defining self. Covers the Interdisciplinary topic for the English major.",
    "credits": 3,
    "active": true,
    "rawPrerequisites": "U3 or U4 standing",
    "prerequisites": {
      "kind": "TRUE"
    },
    "corequisites": null,
    "advisorNotes": null,
    "url": "https://catalog.stonybrook.edu/preview_course_nopop.php?catoid=8&coid=8472"
  },
  {
    "id": "AFH 385",
    "deptCode": "AFH",
    "deptName": null,
    "number": "385",
    "code": "AFH 385",
    "title": "French Caribbean Literature",
    "description": "A study of representative texts from the French Caribbean translated into English, focusing on literary manifestations of a search for a specific identity by writers from Martinique, Guadeloupe, French Guiana, and Haiti.",
    "credits": 3,
    "active": true,
    "rawPrerequisites": "Junior or Senior Standing",
    "prerequisites": {
      "kind": "TRUE"
    },
    "corequisites": null,
    "advisorNotes": null,
    "url": "https://catalog.stonybrook.edu/preview_course_nopop.php?catoid=8&coid=8473"
  },
  {
    "id": "AFH 390",
    "deptCode": "AFH",
    "deptName": null,
    "number": "390",
    "code": "AFH 390",
    "title": "Topics in Africana Studies",
    "description": "May be repeated for credit as the topic changes. Designed for upper-division students, this course provides an in-depth study of a specific topic within humanities disciplines such as music, art, literature, religion, and philosophy. Students will be expected to demonstrate knowledge of the conventions and methods used in the humanities discipline(s) studied. Past topics have included titles such as Black Women Writers; Autobiography and Biography as Black History; and The African Novel: Origins and Development.",
    "credits": 3,
    "active": true,
    "rawPrerequisites": "U3 or U4 standing",
    "prerequisites": {
      "kind": "TRUE"
    },
    "corequisites": null,
    "advisorNotes": null,
    "url": "https://catalog.stonybrook.edu/preview_course_nopop.php?catoid=8&coid=8474"
  },
  {
    "id": "AFH 391",
    "deptCode": "AFH",
    "deptName": null,
    "number": "391",
    "code": "AFH 391",
    "title": "Topics in Africana Studies",
    "description": "May be repeated for credit as the topic changes. Designed for upper-division students, this course provides an in-depth study of a specific topic within humanities disciplines such as music, art, literature, religion, and philosophy. Students will be expected to demonstrate knowledge of the conventions and methods used in the humanities discipline(s) studied. Past topics have included titles such as Black Women Writers; Autobiography and Biography as Black History; and The African Novel: Origins and Development.",
    "credits": 3,
    "active": true,
    "rawPrerequisites": "U3 or U4 standing",
    "prerequisites": {
      "kind": "TRUE"
    },
    "corequisites": null,
    "advisorNotes": null,
    "url": "https://catalog.stonybrook.edu/preview_course_nopop.php?catoid=8&coid=8475"
  },
  {
    "id": "AFH 423",
    "deptCode": "AFH",
    "deptName": null,
    "number": "423",
    "code": "AFH 423",
    "title": "Africana Literature in French",
    "description": "An examination of a range of literature in French produced by writers throughout the African diaspora who claim affiliation with Africa. While the course is conducted in French, students will have the option to write papers in either French or English. Competence in reading and speaking French is a requirement for the course.",
    "credits": 3,
    "active": true,
    "rawPrerequisites": "FRN 395 , FRN 396 or Permission of the Instructor.",
    "prerequisites": {
      "kind": "TRUE"
    },
    "corequisites": null,
    "advisorNotes": null,
    "url": "https://catalog.stonybrook.edu/preview_course_nopop.php?catoid=8&coid=8476"
  },
  {
    "id": "AFH 444",
    "deptCode": "AFH",
    "deptName": null,
    "number": "444",
    "code": "AFH 444",
    "title": "Experiential Learning",
    "description": "This course is designed for students who engage in a substantial, structured experiential learning activity in conjunction with another class. Experiential learning occurs when knowledge acquired through formal learning and past experience are applied to a “real-world” setting or problem to create new knowledge through a process of reflection, critical analysis, feedback and synthesis. Beyond-the-classroom experiences that support experiential learning may include: service learning, mentored research, field work, or an internship.",
    "credits": 0,
    "active": true,
    "rawPrerequisites": "WRT 102 or equivalent; permission of the instructor and approval of the EXP contract ( http://sb.cc.stonybrook.edu/bulletin/current/policiesandregulations/degree_requirements/EXPplus.php )",
    "prerequisites": {
      "kind": "TRUE"
    },
    "corequisites": null,
    "advisorNotes": null,
    "url": "https://catalog.stonybrook.edu/preview_course_nopop.php?catoid=8&coid=8477"
  },
  {
    "id": "AFH 447",
    "deptCode": "AFH",
    "deptName": null,
    "number": "447",
    "code": "AFH 447",
    "title": "Readings in Africana Studies",
    "description": "Individually supervised reading in selected topics in the Black Experience.",
    "credits": 1,
    "active": true,
    "rawPrerequisites": "Permission of instructor and program director",
    "prerequisites": {
      "kind": "TRUE"
    },
    "corequisites": null,
    "advisorNotes": null,
    "url": "https://catalog.stonybrook.edu/preview_course_nopop.php?catoid=8&coid=8478"
  },
  {
    "id": "AFH 475",
    "deptCode": "AFH",
    "deptName": null,
    "number": "475",
    "code": "AFH 475",
    "title": "Undergraduate Teaching Practicum I",
    "description": "Work with a faculty member as an assistant in one of the faculty member’s regularly scheduled classes. The student is required to attend all the classes, do all the regularly assigned work, and meet with the faculty member at regularly scheduled times to discuss the intellectual and pedagogical matters relating to the course. Students may not serve as teaching assistants in the same course twice. Not for major or minor credit.",
    "credits": 3,
    "active": true,
    "rawPrerequisites": "Africana studies major or minor; U4 standing; permission of instructor",
    "prerequisites": {
      "kind": "TRUE"
    },
    "corequisites": null,
    "advisorNotes": null,
    "url": "https://catalog.stonybrook.edu/preview_course_nopop.php?catoid=8&coid=8479"
  },
  {
    "id": "AFH 476",
    "deptCode": "AFH",
    "deptName": null,
    "number": "476",
    "code": "AFH 476",
    "title": "Undergraduate Teaching Practicum II",
    "description": "Work with a faculty member as an assistant in one of the faculty member’s regularly scheduled classes. The student is required to attend all the classes, do all the regularly assigned work, and meet with the faculty member at regularly scheduled times to discuss the intellectual and pedagogical matters relating to the course. Students assume greater responsibility in such areas as leading discussions and analyzing results of tests that have already been graded. Students may not serve as teaching assistants in the same course twice. Not for major or minor credit.",
    "credits": 3,
    "active": true,
    "rawPrerequisites": "AFS 475 ; permission of instructor",
    "prerequisites": {
      "kind": "TRUE"
    },
    "corequisites": null,
    "advisorNotes": null,
    "url": "https://catalog.stonybrook.edu/preview_course_nopop.php?catoid=8&coid=8480"
  },
  {
    "id": "AFH 487",
    "deptCode": "AFH",
    "deptName": null,
    "number": "487",
    "code": "AFH 487",
    "title": "Research in Africana Studies",
    "description": "Individual research projects in the Black Experience carried out under the direct supervision of a faculty member.",
    "credits": 0,
    "active": true,
    "rawPrerequisites": "Permission of instructor and program director",
    "prerequisites": {
      "kind": "TRUE"
    },
    "corequisites": null,
    "advisorNotes": null,
    "url": "https://catalog.stonybrook.edu/preview_course_nopop.php?catoid=8&coid=8481"
  },
  {
    "id": "AFS 101",
    "deptCode": "AFS",
    "deptName": null,
    "number": "101",
    "code": "AFS 101",
    "title": "Themes in the Black Experience I",
    "description": "An historical survey of the experience of black people against the background of a thorough review of American history and the events which impacted upon the black experience in America. This course also examines the responses of African Americans to the changing historical circumstances that they encountered in the United States. Consideration is also given to the similarities and differences among the lifestyles of people of African descent in America. This course treats themes to 1865.",
    "credits": 3,
    "active": true,
    "rawPrerequisites": null,
    "prerequisites": null,
    "corequisites": null,
    "advisorNotes": null,
    "url": "https://catalog.stonybrook.edu/preview_course_nopop.php?catoid=8&coid=8482"
  },
  {
    "id": "AFS 102",
    "deptCode": "AFS",
    "deptName": null,
    "number": "102",
    "code": "AFS 102",
    "title": "Themes in the Black Experience II",
    "description": "An historical survey of the experience of black people against the background of a thorough review of American history and the events which impacted upon the black experience in America. This course also examines the responses of African Americans to the changing historical circumstances that they encountered in the United States. Consideration is also given to the similarities and differences among the lifestyles of people of African descent in America. This course treats themes from 1865 to the present.",
    "credits": 3,
    "active": true,
    "rawPrerequisites": null,
    "prerequisites": null,
    "corequisites": null,
    "advisorNotes": null,
    "url": "https://catalog.stonybrook.edu/preview_course_nopop.php?catoid=8&coid=8483"
  },
  {
    "id": "AFS 221",
    "deptCode": "AFS",
    "deptName": null,
    "number": "221",
    "code": "AFS 221",
    "title": "Introduction to Modern African History",
    "description": "Historical themes in 19th- and 20th-century Africa. Topics include social and political relations in African states; slavery and the slave trade in West Africa; the impact of Christianity and Islam on African colonialism; colonialism and its consequences; nationalist movements and de-colonization; pan-Africanism and the politics of African unity; the postcolonial state project; economic planning in postcolonial Africa; and African states and international politics in the Cold War era.",
    "credits": 3,
    "active": true,
    "rawPrerequisites": null,
    "prerequisites": null,
    "corequisites": null,
    "advisorNotes": null,
    "url": "https://catalog.stonybrook.edu/preview_course_nopop.php?catoid=8&coid=8484"
  },
  {
    "id": "AFS 223",
    "deptCode": "AFS",
    "deptName": null,
    "number": "223",
    "code": "AFS 223",
    "title": "Regional History of Africa",
    "description": "Given the immensity of the African continent, it is often divided into regions (such as east, west, north, or southern, equatorial, the Horn, the Sahel, Atlantic or Indian Ocean) to explore connections and boundaries. This course gives students the opportunity to focus more deeply on a region of Africa. The particular region examined will change each semester. Factors that integrate a region may be environment and land use strategies, long-distance trade networks, religious communities, imperialism, and political regimes. The course will examine the challenges to regional integration, such as conflicts, language diversity, and separatist movements.",
    "credits": 3,
    "active": true,
    "rawPrerequisites": null,
    "prerequisites": null,
    "corequisites": null,
    "advisorNotes": null,
    "url": "https://catalog.stonybrook.edu/preview_course_nopop.php?catoid=8&coid=8485"
  },
  {
    "id": "AFS 239",
    "deptCode": "AFS",
    "deptName": null,
    "number": "239",
    "code": "AFS 239",
    "title": "Introduction to the Caribbean Experience",
    "description": "An introduction to the political economy of contemporary Caribbean societies with emphasis on the historical roots of their present underdevelopment.",
    "credits": 3,
    "active": true,
    "rawPrerequisites": null,
    "prerequisites": null,
    "corequisites": null,
    "advisorNotes": null,
    "url": "https://catalog.stonybrook.edu/preview_course_nopop.php?catoid=8&coid=8486"
  },
  {
    "id": "AFS 240",
    "deptCode": "AFS",
    "deptName": null,
    "number": "240",
    "code": "AFS 240",
    "title": "Issues in Caribbean Society",
    "description": "An analysis of the process of social change in the English, Spanish, and French Caribbean with special emphasis on those societies undergoing rapid transformation.",
    "credits": 3,
    "active": true,
    "rawPrerequisites": null,
    "prerequisites": null,
    "corequisites": null,
    "advisorNotes": null,
    "url": "https://catalog.stonybrook.edu/preview_course_nopop.php?catoid=8&coid=8487"
  }
]