[
  {
    "id": "uuid-asc101",
    "deptCode": "ASC",
    "number": "101",
    "code": "ASC 101",
    "title": "ASC 101: Practicing Engaging Presentations",
    "description": "Engaging Presentations An introduction to the basics of public speaking, including how to engage audiences with relevant and engaging resources. Each week, students prepare and give presentations on various topics, and develop skills including using appropriate body language, effectively utilizing audio and visual aids, finding a personal presentation style, and handling the unexpected. Presentation formats addressed include introductory, instructional, and informational. Students receive feedback from instructors and peers, and are expected to build upon this feedback each week.",
    "credits": 0,
    "active": true,
    "prerequisites": {
      "kind": "TRUE"
    },
    "corequisites": null,
    "advisorNotes": null,
    "fulfills": []
  },
  {
    "id": "uuid-acc210",
    "deptCode": "ACC",
    "number": "210",
    "code": "ACC 210",
    "title": "ACC 210: Financial Accounting",
    "description": "Accounting This course presents an introduction to fundamental financial accounting principles, concentrating on identifying, recording, and communicating the economic events of a business organization. Topics include the accounting cycle, the preparation and presentation of the income statement, retained earnings statement and balance sheet, and an in-depth exploration of the measure and presentation of assets and liabilities.",
    "credits": 3,
    "active": true,
    "prerequisites": {
      "kind": "TRUE"
    },
    "corequisites": null,
    "advisorNotes": null,
    "fulfills": []
  },
  {
    "id": "uuid-acc214",
    "deptCode": "ACC",
    "number": "214",
    "code": "ACC 214",
    "title": "ACC 214: Managerial Cost Analysis and Applications",
    "description": "Cost Analysis and Applications A study of cost concepts, and theories as it relates to cost accumulation systems for product, process and activity based costing, as well as the implementation and evaluation of an accounting system as a source of information for decision making, planning, control, and evaluation of the organization by management. Includes cost-volume-profit analysis, overhead rates, budgeting and variance analysis, statement of cash flows and financial statement ratio analysis.",
    "credits": 3,
    "active": true,
    "prerequisites": {
      "kind": "TRUE"
    },
    "corequisites": null,
    "advisorNotes": null,
    "fulfills": []
  },
  {
    "id": "uuid-acc310",
    "deptCode": "ACC",
    "number": "310",
    "code": "ACC 310",
    "title": "ACC 310: Intermediate Accounting I",
    "description": "Accounting I This course expands upon the basic financial accounting framework and explores the theoretical and analytical applications of Generally Accepted Accounting Principles (GAAP) in a business environment. The student will gain an understanding of financial reporting criteria and the reliance placed upon financial information by external users. Topics include the measurement and reporting of cash, receivables, inventories, and operational assets, revenue recognition and the preparation of financial statements.",
    "credits": 3,
    "active": true,
    "prerequisites": {
      "kind": "COURSE",
      "courseId": "uuid-acc210"
    },
    "corequisites": null,
    "advisorNotes": null,
    "fulfills": []
  },
  {
    "id": "uuid-acc311",
    "deptCode": "ACC",
    "number": "311",
    "code": "ACC 311",
    "title": "ACC 311: Federal Income Taxation I Introduces and explores fundamental income taxation concepts for individuals. Topics include gross income, exclusions, adjusted gross income, deductions, exemptions, tax computations, and credits. Introductory tax concepts, including cash and accrual methods, property acquisitions and dispositions, like-kind exchanges, and passive loss rules are also reviewed. Additionally, students will familiarize themselves with tax planning concepts, the legislative process, and professional responsibilities in tax practice.",
    "description": "Income Taxation I Introduces and explores fundamental income taxation concepts for individuals. Topics include gross income, exclusions, adjusted gross income, deductions, exemptions, tax computations, and credits. Introductory tax concepts, including cash and accrual methods, property acquisitions and dispositions, like-kind exchanges, and passive loss rules are also reviewed. Additionally, students will familiarize themselves with tax planning concepts, the legislative process, and professional responsibilities in tax practice.",
    "credits": 3,
    "active": true,
    "prerequisites": {
      "kind": "TRUE"
    },
    "corequisites": null,
    "advisorNotes": null,
    "fulfills": []
  },
  {
    "id": "uuid-acc313",
    "deptCode": "ACC",
    "number": "313",
    "code": "ACC 313",
    "title": "ACC 313: Intermediate Accounting II",
    "description": "Accounting II This course is the second in the intermediate accounting sequence ( ACC 310 ). This course continues in the exploration of the financial accounting framework and the theoretical and analytical applications of Generally Accepted Accounting Principles (GAAP). Topics the study of advanced topics including accounting for investments, stockholders equity, pensions, leases, income taxes, bonds, and other contemporary financial accounting issues.",
    "credits": 3,
    "active": true,
    "prerequisites": {
      "kind": "COURSE",
      "courseId": "uuid-acc310"
    },
    "corequisites": null,
    "advisorNotes": null,
    "fulfills": [
      {
        "category": "SBS"
      }
    ]
  },
  {
    "id": "uuid-acc314",
    "deptCode": "ACC",
    "number": "314",
    "code": "ACC 314",
    "title": "ACC 314: Federal Income Taxation II Introduces and explores fundamental income taxation concepts for business entities, with a focus on C corporations, S corporations, and partnerships. Topics include the formation, operation, reorganization and liquidation of C corporations, as well as the formation, operation and liquidation of flow-through entities. Students will also familiarize themselves with specialty topics concerning estates and trusts, transfer taxes and jurisdictional taxation.",
    "description": "Income Taxation II Introduces and explores fundamental income taxation concepts for business entities, with a focus on C corporations, S corporations, and partnerships. Topics include the formation, operation, reorganization and liquidation of C corporations, as well as the formation, operation and liquidation of flow-through entities. Students will also familiarize themselves with specialty topics concerning estates and trusts, transfer taxes and jurisdictional taxation.",
    "credits": 3,
    "active": true,
    "prerequisites": {
      "kind": "COURSE",
      "courseId": "uuid-acc311"
    },
    "corequisites": null,
    "advisorNotes": null,
    "fulfills": []
  },
  {
    "id": "uuid-acc400",
    "deptCode": "ACC",
    "number": "400",
    "code": "ACC 400",
    "title": "ACC 400: External Auditing",
    "description": "Auditing The course is designed to introduce and explore basic auditing principles, concepts and applications within the context of the audit of an annual financial statement. This course will review the audit process and cover the following: planning (identification of the risks of material misstatement); application of procedures (reducing audit risk below an acceptable level); assessment (based upon documented audit evidence); and, reporting (in accordance with generally accepted auditing standards) This course will also examine professional ethical standards and their relevance to the audit process. Other topics will include analysis and testing of internal control, substantive testing, and accounting research.",
    "credits": 3,
    "active": true,
    "prerequisites": {
      "kind": "COURSE",
      "courseId": "uuid-acc210"
    },
    "corequisites": null,
    "advisorNotes": null,
    "fulfills": []
  },
  {
    "id": "uuid-acc402",
    "deptCode": "ACC",
    "number": "402",
    "code": "ACC 402",
    "title": "ACC 402: Advanced Accounting",
    "description": "Accounting This course provides students with in-depth and up-to-date coverage of accounting for investments, business combinations, consolidated financial statements, segment and interim reporting, foreign currency transactions, and partnerships. The course links theory and practice with consistent emphasis on the logic of procedures.",
    "credits": 3,
    "active": true,
    "prerequisites": {
      "kind": "COURSE",
      "courseId": "uuid-acc313"
    },
    "corequisites": null,
    "advisorNotes": null,
    "fulfills": []
  },
  {
    "id": "uuid-aim100",
    "deptCode": "AIM",
    "number": "100",
    "code": "AIM 100",
    "title": "AIM 100: EOP Pre-Freshman Summer Academic Bridge",
    "description": "Pre-Freshman Summer Academic Bridge The purpose of the EOP Summer Academic Bridge course is to give students a foundation in math, writing, and a science related to their undergraduate goals. The course will build on their current skills with the goal of increasing the likelihood of their academic success in these areas during their first full semester at Stony Brook University. Students will be placed in the appropriate section based on the university placement recommendations in math and writing. The EOP Summer Academic Bridge will be supported through the EOP Transitional Support Bridge course.",
    "credits": 3,
    "active": true,
    "prerequisites": {
      "kind": "TRUE"
    },
    "corequisites": null,
    "advisorNotes": null,
    "fulfills": []
  }
]